import { useTranslation } from "react-i18next";
import styles from "assets/styles/about.module.scss"
const About = () => {
  const { t } = useTranslation();
  return (
    <div id={styles.about}>
      <h1>{t("درباره من")}</h1>
      <p>
        {t(`شهروز بذرافشان هستم و در حال حاضر به عنوان توسعه‌دهنده ارشد در حوزه کدنویسی سمت کلاینت با استفاده از Next.js فعالیت دارم. مسیری پر از تجربه و یادگیری را طی کرده‌ام که شامل توسعه فرانت‌اند با React و Next.js، بک‌اند با دات‌نت و Node.js و همچنین طراحی و پیاده‌سازی اپلیکیشن‌های موبایلی با React Native می‌شود.
خلق اپلیکیشن‌های کارآمد، زیبا و پرکاربرد که زندگی کاربران را آسان‌تر می‌کند، همواره یکی از اهداف اصلی من بوده است. در طول این مسیر، جلب اعتماد مدیران، موفقیت تیمی و ایجاد ارزش واقعی برای کاربران را از بزرگ‌ترین افتخارات خود می‌دانم.
با اعتقاد به یادگیری مستمر و همراهی با تکنولوژی‌های روز، در موقعیت‌هایی مانند Team Lead و Senior Developer فعال هستم و به دنبال چالش‌های جدید برای رشد فردی و تیمی می‌باشم.`)}
      </p>
    </div>
  );
};
export default About;
